cfd/openfoam/unit_cell/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------*\
  Cuts the rod (rod.stl) out of the background box.
  addLayers is OFF in this first pass - see cfd/openfoam/README.md.
\*-----------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    rod.stl
    {
        type triSurfaceMesh;
        name rod;
    }
}

castellatedMeshControls
{
    maxLocalCells       200000;
    maxGlobalCells      2000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    features
    (
    );

    refinementSurfaces
    {
        rod
        {
            level (2 2);
            patchInfo { type wall; }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
    }

    // Chosen well outside the rod (radius 0.07 m) but inside the
    // half-pitch box (a=0.0775 m): corner point at 0.95*a in x and y.
    locationInMesh (0.073625 0.073625 0.005);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch     3;
    tolerance        2.0;
    nSolveIter       30;
    nRelaxIter       5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers {}
    expansionRatio        1.2;
    finalLayerThickness   0.3;
    minThickness          0.1;
    nGrow                 0;
    featureAngle          130;
    nRelaxIter            5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals        3;
    nSmoothThickness      10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle    90;
    nBufferCellsNoExtrude 0;
    nLayerIter            50;
}

meshQualityControls
{
    #includeEtc "caseDicts/mesh/generation/meshQualityDict"
}

mergeTolerance 1e-6;
