cfd/openfoam/unit_cell/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;

// Air at ~295 K, matching the paper's constant-temperature wall case.
nu              nu [0 2 -1 0 0 0 0] 1.5e-05;
