cfd/openfoam/unit_cell/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 1.872);

boundaryField
{
    rod
    {
        type            noSlip;
    }
    xMin
    {
        type            symmetryPlane;
    }
    xMax
    {
        type            symmetryPlane;
    }
    yMin
    {
        type            symmetryPlane;
    }
    yMax
    {
        type            symmetryPlane;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}
