cfd/openfoam/unit_cell/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    rod
    {
        type            zeroGradient;
    }
    xMin
    {
        type            symmetryPlane;
    }
    xMax
    {
        type            symmetryPlane;
    }
    yMin
    {
        type            symmetryPlane;
    }
    yMax
    {
        type            symmetryPlane;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}
