cfd/openfoam/unit_cell/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    rod
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    xMin
    {
        type            symmetryPlane;
    }
    xMax
    {
        type            symmetryPlane;
    }
    yMin
    {
        type            symmetryPlane;
    }
    yMax
    {
        type            symmetryPlane;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}
