cfd/openfoam/unit_cell/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

// omega = sqrt(k)/(Cmu^0.25 * l), l = 0.038*Dh, Dh=0.0785 m, Cmu=0.09.
internalField   uniform 71.1;

boundaryField
{
    rod
    {
        type            omegaWallFunction;
        value           uniform 71.1;
    }
    xMin
    {
        type            symmetryPlane;
    }
    xMax
    {
        type            symmetryPlane;
    }
    yMin
    {
        type            symmetryPlane;
    }
    yMax
    {
        type            symmetryPlane;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}
