cfd/openfoam/unit_cell/system/sampleDict
// Run with: sample -latestTime   (or: postProcess -func sampleDict -latestTime
// on versions where the standalone `sample` utility has been folded into
// postProcess - same dict format either way).
//
// Line 1 = gap line: rod surface -> unit-cell symmetry boundary along x
//          (the narrow rod-to-rod gap direction, P/D=1.107).
// Line 2 = diagonal subchannel line: rod surface -> cell corner along the
//          45-degree diagonal (bulk subchannel region).
// See paper_reference/NOTES.md for why these two lines, and the caveat
// that "Line 1"/"Line 2" aren't independently confirmed against the actual
// figures.

interpolationScheme cellPoint;
setFormat           raw;

sets
(
    line1
    {
        type    uniform;
        axis    distance;
        start   (0.07      0         0.005);
        end     (0.0775    0         0.005);
        nPoints 50;
    }
    line2
    {
        type    uniform;
        axis    distance;
        start   (0.0494975 0.0494975 0.005);
        end     (0.0775    0.0775    0.005);
        nPoints 50;
    }
);

fields (U k);
